IDEA StatiCa Open Model
Element2D.InnerLines Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Inner lines of this region
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<ReferenceElement> InnerLines { get; set; }
Public Property InnerLines As List(Of ReferenceElement)
	Get
	Set
public:
property List<ReferenceElement^>^ InnerLines {
	List<ReferenceElement^>^ get ();
	void set (List<ReferenceElement^>^ value);
}
Property Value
Type: List<ReferenceElement>
See Also
Reference
Element2D Class
IdeaRS.OpenModel.Model Namespace